const nadaA = [
    ["灘高等学校Ａ"],
    ["", "灘Ａ氷柱先鋒", "", "灘Ａ氷柱中堅", "", "灘Ａ氷柱大将"],
    ["", "灘Ａ白鳥先鋒", "", "灘Ａ白鳥中堅", "", "灘Ａ白鳥大将"],
    ["", "灘Ａ関先鋒", "", "灘Ａ関中堅", "", "灘Ａ関大将"],
    ["", "灘Ａ雑煮先鋒", "灘Ａ雑煮次鋒", "灘Ａ雑煮中堅", "灘Ａ雑煮副将", "灘Ａ雑煮大将"]
];
const nadaB = [
    ["灘高等学校Ｂ"],
    ["", "灘Ｂ氷柱先鋒", "", "灘Ｂ氷柱中堅", "", "灘Ｂ氷柱大将"],
    ["", "灘Ｂ白鳥先鋒", "", "灘Ｂ白鳥中堅", "", "灘Ｂ白鳥大将"],
    ["", "灘Ｂ関先鋒", "", "灘Ｂ関中堅", "", "灘Ｂ関大将"],
    ["", "灘Ｂ雑煮先鋒", "灘Ｂ雑煮次鋒", "灘Ｂ雑煮中堅", "灘Ｂ雑煮副将", "灘Ｂ雑煮大将"]
];
const rakunan = [
    ["洛南高校"],
    ["", "洛南氷柱先鋒", "", "洛南氷柱中堅", "", "洛南氷柱大将"],
    ["", "洛南白鳥先鋒", "", "洛南白鳥中堅", "", "洛南白鳥大将"],
    ["", "洛南関先鋒", "", "洛南関中堅", "", "洛南関大将"],
    ["", "洛南雑煮先鋒", "洛南雑煮次鋒", "洛南雑煮中堅", "洛南雑煮副将", "洛南雑煮大将"]
];
const okayamaasahi = [
    ["岡山朝日高等学校"],
    ["", "岡山朝日氷柱先鋒", "", "岡山朝日氷柱中堅", "", "岡山朝日氷柱大将"],
    ["", "岡山朝日白鳥先鋒", "", "岡山朝日白鳥中堅", "", "岡山朝日白鳥大将"],
    ["", "岡山朝日関先鋒", "", "岡山朝日関中堅", "", "岡山朝日関大将"],
    ["", "岡山朝日雑煮先鋒", "岡山朝日雑煮次鋒", "岡山朝日雑煮中堅", "岡山朝日雑煮副将", "岡山朝日雑煮大将"]
];
const osakatoin = [
    ["大阪桐蔭中学高等学校"],
    ["", "大阪桐蔭氷柱先鋒", "", "大阪桐蔭氷柱中堅", "", "大阪桐蔭氷柱大将"],
    ["", "大阪桐蔭白鳥先鋒", "", "大阪桐蔭白鳥中堅", "", "大阪桐蔭白鳥大将"],
    ["", "大阪桐蔭関先鋒", "", "大阪桐蔭関中堅", "", "大阪桐蔭関大将"],
    ["", "大阪桐蔭雑煮先鋒", "大阪桐蔭雑煮次鋒", "大阪桐蔭雑煮中堅", "大阪桐蔭雑煮副将", "大阪桐蔭雑煮大将"]
];
const nagata = [
    ["兵庫県立長田高等学校"],
    ["", "長田氷柱先鋒", "", "長田氷柱中堅", "", "長田氷柱大将"],
    ["", "長田白鳥先鋒", "", "長田白鳥中堅", "", "長田白鳥大将"],
    ["", "長田関先鋒", "", "長田関中堅", "", "長田関大将"],
    ["", "長田雑煮先鋒", "長田雑煮次鋒", "長田雑煮中堅", "長田雑煮副将", "長田雑煮大将"]
];
